Refactored and Fixed
